package blue

var msgs = map[int]string{
	0:   "成功",
	101: "无此用户",
	102: "密码错误",
	103: "发短信提交过快",
	104: "系统非常忙",
	105: "敏感消息表发~查水表",
	106: "太长了~受不了（>536或<=0）",
	107: "包含错误的手机号码",
	108: "手机号码个数错（群发>50000或<=0;单发>200或<=0）",
	109: "无发送额度（该用户可用短信数已使用完）",
	110: "不在发送时间内",
	111: "超出该账户当月发送额度限制",
	112: "无此产品，用户没有订购该产品",
	113: "extno格式错（非数字或者长度不对）",
	115: "自动审核驳回",
	116: "签名不合法，未带签名（用户必须带签名的前提下）",
}

const (
	GETURL = "http://222.73.117.158/msg/HttpBatchSendSM"
)

var (
	ACCOUNT  string
	PASSWORD string
)
